reply_unreg_user0 = "Привет!\n" \
                    "Как тебя зовут?\n"

reply_options_change_name = "Хорошо!\n" \
                    "Как тебя зовут теперь?\n"

empty_msg = "хмех"

reply_choose_command = "Выберите одну из возможных опций"

reply_reg_FIO = "Как тебя зовут?"

reply_admin_password = "Чтобы стать админом надо знать особое слово...\n" \
                       "Знаешь его?"
reply_admin_change_succ = "Вау...ты теперь админ еклм! \U0001f604"
reply_admin_change_denied = "Не тот пассворд..🙀🙎"

reply_main_options = "В общем опции: "

reply_event_markup = "{}\nКогда: {} {}\nКак долго: {}\nПроводит: {}\n{}\n"
